{"South Africa's Henri van Breda given life for axe murder of family":"A South African man who murdered his parents and brother with an axe has been sentenced to life in prison.\rHenri van Breda, 23, was also given 15 years for the attempted murder of his teenage sister, Marli, during the frenzied January 2015 attack.\rSitting in the High Court, Judge Siraj Desai said the \"cold-blooded murders\" had been carried out with \"excessive and gratuitous violence\".\rVan Breda's defence lawyer says he intends to appeal.\rThe case has horrified South Africans, with one paramedic telling the court the scene in the family's upmarket Stellenbosch home was the worst thing he had seen in a career spanning almost four decades.\rVan Breda, then just 20, used an axe to slaughter his father, Martin, 54, his mother, Teresa, 55, and older brother Rudi, 22, as they slept.\rHe also attacked his sister Marli, then just 16, apparently leaving her for dead.\rVan Breda denied all charges against him, claiming he had also been a victim of a man he claimed had broken in and attacked his family.\rHowever, the court did not believe his version of events, finding him guilty of three counts of murder, one of attempted murder and one of obstructing justice in May, more than three years after the vicious assault.\rSentencing Van Breda in the Western Cape High Court today, Judge Desai noted Van Breda had failed to give any explanation for his actions, or \"displayed any remorse\".\rHe added that \"society expected no less\" than the \"severest possible penalties\" for his crime.\rA date to apply for leave to appeal against his conviction and sentences, which will run concurrently, was set for 27 June.","Henri van Breda trial: The man who killed his family with an axe":"Henri Van Breda, who murdered his father, mother and brother with an axe in South Africa in 2015, has been sentenced to life in prison.\rA South African paramedic describing the aftermath of the attack on the wealthy Van Breda family said it was the worst thing he had seen in his 39-year career.\r\"Blood ran like a waterfall down the stairs,\" testified now-retired Christiaan Koegelenberg.\rMore than three years after Mr Koegelenberg walked into the midst of that horrific scene, a judge has found the family's only surviving son, Henri, guilty of using an axe to kill his mother, father and brother.\rHis younger sister managed to survive the attack in their home in a gated housing estate in Stellenbosch in South Africa's wine region.\rVan Breda, was 20 at the time of attack - but the motive for the horrific murders is still not known.\rSome believe he did it was to inherit his father's multi-million dollar estate, but this was never proven.\rWhatever the motive, investigators and South Africans alike have been left shocked by the violent nature of the attack.\rMartin and Teresa van Breda were found in a pool of blood on the first floor of their home on the De Zalze Golf Estate on the morning of 27 January 2015.\rClose by was the body of their 22-year-old son Rudi and their 16-year-old daughter Marli, who was fighting to stay alive. Van Breda, meanwhile, had sustained only minor injuries.\rThe attacker had moved quickly and determinedly.\rThe Western Cape High Court agreed that the extent of the injuries meant that the assailant had intended to kill.\rVan Breda gave a statement to police soon after the incident saying that a well-built black intruder was to blame.\rHe described a man wearing gloves and a balaclava breaking into the family home.\rA recording of his phone call to the emergency services, made at around 07:00, was played to the court.\r\"My... my family and me were attacked... by a guy with an axe,\" he said.\rBut who would want to kill the family in such a brutal and merciless manner?\r\"No-one,\" said Cornelius Andries van Breda.\rHe testified at his nephew's trial saying that his 54-year-old brother Martin and sister-in-law Teresa, 55, were loving people who had no enemies.\rHe told the court they had been a close-knit family.\rInitially, Van Breda's version of events seemed plausible - he had sustained minor lacerations.\rSouth Africa's high crime rate also made it believable - many live in fear of the \"intruder in the mask\".\rVan Breda told the court that he wrestled the intruder, who then stabbed him in the torso with a knife.\rBut 18 months into the investigation, police believed Van Breda was the only suspect.\rHe maintained his innocence during the 67-day trial.\rThe court heard that many, if not all, of his injuries had been self-inflicted.\rThe prosecution pointed to many other inconsistencies in Van Breda's testimony.\rWhy would an intruder seeking to rob a home ignore valuable items downstairs and embark on a killing spree upstairs instead?\rVan Breda could not answer that.\rHe also could not answer why there were no signs of forced entry or why he had escaped the deep gashes his family suffered.\rExperts who analysed those gashes testified that they came from one attacker, who used the same amount of force on each victim.\rThe security experts at the trial all but said that not even Houdini could have broken into the Van Bredas' home.\rThe De Zalze Golf Estate has been described as a \"medium-security\" gated community.\rBut in truth it was considered one of the safest places to live in South Africa, with motion detectors, an alarm-system, 24-hour guard patrol, access-controlled gates and an electric fence.\rAnother inconsistency that unsettled the court was the amount of time it took Van Breda to ring the emergency services.\rCourt papers reveal that a distressed Van Breda called his girlfriend at 04:42 numerous times, but they went unanswered.\rHe then searched the internet for local emergency numbers, not calling for help until nearly three hours later.\rIt was argued that Van Breda wanted his family to bleed to death.\rAsked to account for the time lapse, the young man said he had collapsed after witnessing his family being attacked and remained unconscious for hours.\rA year before the attack, the Van Bredas had been living happily in Melbourne in Australia.\rThey had decided to move back primarily because of Martin van Breda's business interests.\rHis wife Teresa also wanted to live closer to her family.\rHenri and their oldest son Rudi, a motor-sport enthusiast, remained in Australia as they were studying at the University of Melbourne.\rThey then joined the family in South Africa later in 2014.\rIn court, Van Breda said they were \"a normal family\" with normal disagreements.\rIf any of the children got into arguments with their parents, it was generally Marli who was \"growing and rebelling,\" he said.\rMarli, who underwent extensive surgery and physiotherapy after the attack, still has no recollection of the horrific day.\rHer extensive head injuries and self-defence wounds were used to lead testimony in court.\rOf all the victims, Marli, had put up the greatest fight.\rUnlike her mother and brother, who had minor defensive wounds, which may mean they were asleep shortly before the attack, Marli maybe saw Van Breda coming and tried to fight him off.\rHer father, Martin, had deep wounds on his back. Delivering his sentence, Judge Desai said this was an indication that he had used his own body to try and shield Rudi from his axe-wielding brother, believing perhaps that his son would not strike him. But he did.\rAddressing Van Breda in court, Judge Desai said the brutality of the attack showed \"an unprecedented disregard for [your] family\".\rA neighbour living a few hundred metres from the Van Bredas' home told the court during the trial that she heard what sounded like loud, arguing voices late that evening.\rThe defence had argued it was the sound of a film being played at a high volume.\rNeighbours and close family friends described Van Breda as always having been the \"black sheep\" of the family.\rWhile the other Van Breda children had been thriving at school and university, he had decided to drop out of his studies.\rHe came to live with his parents in South Africa in August 2014, taking a \"gap year\" with no real plan for his life - perhaps disappointing his loving but strict father.\rHe reportedly also had a drug addiction, leading his parents to threaten to cut-off his allowance if he did not clean up his act.\rMany believe the pressure of not measuring up to the expectations of the perfect family may have driven him to the edge, just months after he arrived in South Africa.\rBut justice has now been served for the unsuspecting victims of Henri van Breda. We still do not know what snapped in the mind of young Henri, only that something did and it left a trail of blood in its wake.","Ethiopia offers Eritrea chance to end Africa's longest war":"Ethiopia's surprise announcement that it will abide by a 2002 border ruling raises the prospect of a final end to what was Africa's deadliest border war and peace with its long-time rival, Eritrea.\rTens of thousands of people were killed in the two-year conflict and Eritrea remains on a war footing, demanding that Ethiopia withdraws from the \"occupied territory\".\rIt seems pretty genuine.\rEthiopian Prime Minister Abiy Ahmed signalled in his inauguration speech in April that a major policy shift could be in the offing - he called on Eritrea to resolve their differences, saying the two neighbours were \"not only intertwined in interests but also in blood\".\rNow, the ruling Ethiopian People's Revolutionary Democratic Front (EPRDF) has announced it will fully accept and implement the peace deal that ended the war.\rMr Abiy said soldiers deployed to the contested town of Badme had experienced \"psychological effects\", according to the state-linked Fana Broadcasting Corporate.\r\"We should end this suffering, and fully return to peace,\" the prime minister is quoted as saying.\rEthiopia's previous leaders always said they accepted the 2002 ruling but they never actually implemented it.\rMr Abiy's announcement is especially significant as it comes after the release of thousands of jailed politicians, activists and protesters, including British citizen Andargachew Tsege who was being held on death row, and the promise of wider reforms.\rEritrea has not commented on Ethiopia's announcement but Information Minister Yemane Gebre Meskel had previously told the BBC that relations could not be resolved until Ethiopia withdrew \"from the occupied territories\".\r\"The ball is now in Eritrea's court,\" Tesfalem Araia from the BBC's Tigrinya service says.\r\"Eritrea has been on a war footing and the justification for forced conscription into the army has been the conflict with Ethiopia,\" he adds.\rThat forced conscription is the reason given by most of the thousands of Eritreans who flee the country, making the perilous journey to Europe.\rRead more:\rThe story behind Africa's unfinished war\rHas Eritrea's migration problem been exaggerated?\rAssuming that Eritrea accepts Ethiopia's goodwill, the next step would be for officials from the Eritrea-Ethiopia Boundary Commission to physically demarcate the border.\rUntil now, this has been impossible because it is a military zone.\rThe main bone of contention is the town of Badme, the main focus of the war, but there are other disputed areas right along the border.\rBadme is a nondescript, heavily militarised small town with little or no social activity.\rMore than 1,000 people live there, with almost all their activities limited to military services, says the BBC's Berihu Lilay, who visited the town in January.\rHe says he saw Eritrean and Ethiopian forces sitting in neat rows facing each other across the border, with just a few kilometres separating them.\rResidents told our reporter they look forward to peace between the two nations.\rDespite the strain, the 16-year standoff has not cut the ancient ties between the two border communities who both belong to the Tigrinya ethnic group, our reporter says.\rA potential flashpoint, he says, which will need to be negotiated delicately, is the fate of a graveyard where thousands of Ethiopian soldiers, including top army leaders, who died in the conflict have been buried.\rIt seems as though everything is changing pretty fast in Ethiopia, since Mr Abiy came to power.\rJust a few months ago, a state of emergency was imposed following the resignation of Hailemariam Desalegn as prime minister. He said he was standing down in order to end months of anti-government protests, which had led to many deaths and arrests.\rSince taking office, Mr Abiy has moved fast to spend the political capital he had earned after gaining the backing of the EPRDF to become prime minister.\rThree months in, he has managed to get the ruling coalition to back his policies including the lifting of the state of emergency.\rBeing the leader of the Oromo People's Democratic Organisation (OPDO), one of the four ethnic parties which make up the EPRDF coalition, provides him with a solid political base to implement his policies.\rHe has also in a short time managed to assert his authority and created excitement in the country about his leadership.\r\"There's palpable optimism about Mr Abiy in the country,\" says the BBC's Emmanuel Igunza in Addis Ababa.\rFew would have predicted that the opening of the first Pizza Hut in Addis Ababa in April was an indicator that Ethiopia was opening up its state-controlled economy.\rAt the same time as the announcement was made about respecting the border ruling, the ruling coalition also said it had approved a policy to loosen the state's grip in the energy, telecoms, logistics and aviation sectors to allow private domestic and foreign investment - another huge shock, with potentially massive implications.\rInvestors will be able to acquire a limited stake in Ethio Telecom, Ethiopian Airlines, one of Africa's largest and most successful airlines, Ethiopian Electric Power and Ethiopian Shipping and Logistics Services Enterprise.\rInvestments in the telecommunication sector could help improve mobile and internet services which have not seen the same rapid expansion as in the rest of the world.\rUntil now, a state firm has had a monopoly on internet access, which remains costly and slow.\rAnalysts see the liberalisation, however limited, as part of the government's plan to rescue the economy, which had been one of the fastest-growing in Africa.\rThe Financial Times recently reported that China, Ethiopia's biggest foreign investor, was scaling back investment in the face of rising foreign exchange shortages and government debt.\rThe IMF forecasts that Ethiopia will have 8.5% growth this year, down from a consistent 10% in the last decade.\rHallelujah Lulie, an analyst on Horn of Africa affairs observes: \"As things stand now, there is a fine line between buying state enterprises and buying the state in Ethiopia. We don't want a transition from an authoritarian state to a private tyranny. The decision to partially privatise some of the commanding heights is unwise to say the least.\"\rDespite these reservations, it seems as though there is a real chance that Ethiopia, Africa's second-most populous country, could be about to change from a tightly-controlled state under the permanent threat of war, to a place where citizens may be able to enjoy more freedom on a number of different levels.","Scores of Ethiopian migrants drown off Yemen's coast":"At least 46 migrants trying to cross from Somalia to Yemen have drowned when their boat capsized, UN officials say.\rAnother 16 people are missing after the vessel overturned in rough seas off Yemen's coast, the International Organization for Migration (IOM) says.\rSurvivors say the smuggler's boat was carrying at least 100 people who had left the port of Bosaso to find work in Yemen and other Gulf countries.\rAll the migrants were Ethiopian nationals, reports say.\rThe IOM says the boat capsized in the Gulf of Aden on Wednesday morning. Among the victims were 37 men and nine women.\rA number of passengers on board the crammed vessel were without life jackets, survivors say.\r\"Over 7,000 poor migrants take this perilous journey every month; some 100,000 took it just last year,\" said IOM official Mohammed Abdiker.\r\"They are treated appallingly and go through horrendous conditions. This has to end,\" he added.\rMigrants and refugees have been travelling to Yemen from the Horn of Africa for decades because of its proximity and the perception of the country as a gateway to other Gulf states and Europe.\rBut the country is in the midst of a civil war and is facing a dire humanitarian crisis.\rA note on terminology: The BBC uses the term migrant to refer to all people on the move who have yet to complete the legal process of claiming asylum. This group includes people fleeing war-torn countries such as Syria, who are likely to be granted refugee status, as well as people who are seeking jobs and better lives, who governments are likely to rule are economic migrants.","Could a text message save thousands of fishermen's lives?":"We can't stop Nature when it unleashes its fury in the form of volcanoes, earthquakes, storms and avalanches, but we can use technology to warn us of imminent danger - and save lives.\rAs the sun sets over Lake Victoria, Africa's largest lake, tens of thousands of fishermen ready themselves to head out on the water for the night, fishing mostly for tilapia and Nile perch.\rAs they push off, they know they are risking their lives - some of them may never be seen again.\rLake Victoria - a lake so big it straddles Uganda, Tanzania and Kenya - is notorious for its deadly storms. At this time of year, strong winds, rain, lightning and huge waves are a regular occurrence.\rUp to 5,000 fishermen lose their lives each year, says the International Red Cross.\r\"The storms usually start at midnight and last until around 6am,\" says Amone Ponsiano, officer in charge at the Marine Police, Nkose Island, Uganda.\r\"This is the exact time when the fishermen are very busy, collecting their nets. It's very dangerous and we have a lot of people disappearing.\"\rRecently, one man's boat was smashed on the rocks as he tried to escape a violent storm, but Mr Ponsiano's team managed to fish him out of the water in the nick of time.\rBut a new early warning system developed by an international team of scientists and technologists could end up saving hundreds of lives.\rSimply put, real-time satellite data from Nasa is applied to a statistical model and used to forecast the probability of an extreme thunderstorm. This probability is translated into a simple warning message delivered to fishermen via text message, Twitter or WhatsApp.\rProf Wim Thiery, lead researcher on the project - a joint venture between Brussels-based university Vrije Universiteit Brussel, Switzerland's ETH Zurich university, Nasa, and CodeForAfrica - says there is a \"great potential\" for new technologies, in particular machine learning, to improve the prediction of extreme weather.\rAs erratic weather becomes more common due to climate change, such tech will become increasingly important to make us \"less vulnerable\", he says.\r\"Just like with the traditional weather forecast, there will always be misses and false alarms,\" he admits. \"We are dealing with a deterministic chaos system, so you can't predict everything.\r\"But we clearly see that with time, our ability to forecast extreme events improves, thanks to better weather models, better supercomputers, and innovative techniques.\"\rExtreme weather isn't only a mortal peril in Africa.\rIn 2014, Stanford engineering student Ahmad Wani found himself marooned for a week awaiting rescue from extreme flooding in Kashmir, India. The floods claimed hundreds of lives.\rSince the incident, he has focused his engineering skills on developing a machine learning platform aimed at predicting the impact of natural disasters. Better predictions would enable urban communities to prepare better, he believes.\rTeaming up with two of his student colleagues, Mr Wani co-founded One Concern to tackle the issue.\r\"By 2030, 60% of the world's population will live in cities,\" he says, \"with 1.4 billion facing the highest risk of exposure to a natural disaster.\r\"These are sobering statistics, but the good news is outcomes can be changed. By having the insights to better prepare for, respond to, recover from and mitigate against disasters, leaders can reduce the risk that their people face,\" argues Mr Wani.\rAnalysing huge amounts of data and developing predictive models has helped them advise communities on how to improve their disaster response plans.\rFor example, one client had stored supplies for shelter, water, and first aid in a community-owned building they had planned to use as a shelter and relief staging point in the event of an earthquake.\rBut One Concern's simulations showed that this building stood a high chance of being significantly damaged, so was unsuitable for the role.\rThe emergency response plan needed rethinking; the building needed strengthening.\rThe company is currently working with Los Angeles and San Francisco on how to disaster-proof their cities, and aims to roll out its platform globally.\r\"We are on a mission to save lives and livelihoods and believe in the power of benevolent artificial intelligence to help do so,\" Mr Wani says.\rColorado-based Avalanche Lab believes that even simple tech can save lives.\rAbout 150 people are killed by avalanches every year. But with two thirds of the world's population owning a mobile, half of which are smartphones, Avalanche Lab thinks a phone app could prove the most effective avalanche prevention and rescue tool in the winter survival kit.\rThe AvyLab \"crowdmaps\" avalanche data and makes it accessible to those out in the snow. Users record snow observations, pin notes on a map, and share the data with the community. Meteorological information is also provided via the app, with the aim of helping users make informed decisions about venturing out.\r\"A phone app for avalanche safety is not a 'magic bullet' for decreasing avalanche incidents,\" says AvyLab app creator Michael Murphy, \"but rather a way for creating a more informed and connected general public, which will make a difference in decreasing avalanche fatalities.\"\rMore Technology of Business\rTech to warn of impending disaster is being applied around the world to save lives, limit infrastructure damage and aid emergency services.\rIn Mexico, for example, start-up Grillo is installing $50 (£37) seismic sensors along the coast to give early warning of impending earthquakes to residents via a smartphone app. Such warnings may only give residents an extra 90 seconds to prepare, but that's enough potentially to save lives, the founders believe.\rTech may not be able to control Mother Nature, but at least it is helping us prepare for an unpredictable world.","South Africa's school pit latrine scandal: Why children are drowning":"During his first week at school, five-year-old Michael Komape drowned in a pit latrine in northern South Africa.\rThat day in January 2014 will be one his father James Komape will never forget.\rAs he takes me back to the school in Chebeng village, where the tragedy struck, his pain is palpable.\r\"When I arrived at the opening of the toilet hole all I could see was a small hand,\" he says.\r\"Some people were standing looking into the hole, no-one had thought to take him out. It's the saddest thing I've ever seen.\r\"No-one should die like that.\"\rHe pauses for a moment before continuing.\r\"He must have been trying to call for help to maybe even climb out. It's hard to accept that my son died alone and probably afraid.\"\rMr Komape struggles to make eye contact.\rInstead he fixes his eyes on the neat row of brick toilet stalls, which were built after his son died in the toilet of rusty corrugated iron just metres away.\rThe iron sheet that had served as the seat collapsed when Michael sat on it. He fell in, along with the seat and its white plastic lid, the authorities said.\rBut this is not a one-off problem affecting one school.\rWhile access to proper sanitation is a basic human right enshrined in South Africa's constitution, many pupils have no choice but to use pit toilets.\rRead more:\rIs South Africa's education system really 'in crisis'?\rSouth Africans' anger over land set to explode\rSouth African 'world's oldest man' wants to stop smoking\rHow did things get so bad?\rAnalysts say it is partly a legacy of apartheid, since under white-minority rule virtually no resources were allocated to develop schools for poor, predominately black children.\rAlso to blame is the failure to maintain existing infrastructure, however basic.\rBack at their home just outside Polokwane, the main city in Limpopo province, the Komapes tell me they want justice for Michael's death.\rWith the help of Section27, a human rights law firm, the family are set to appeal against a recent court ruling which rejected their claim for damages over the incident.\rThe suit is against Limpopo province's education department, which the family believes was negligent.\r\"The Komape case is a tragic one but it is an illustration of the dire state of public school facilities in the country,\" Section27's Zukiswa Pikoli told the BBC.\r\"We were quite shocked when we heard about the tragedy. There was no way we were not going to help.\"\rMs Pikoli says Section27 is planning to take the case to the Constitutional Court, South Africa's highest court.\rThe Komapes are not the only family to lose a child in this manner.\rEarlier this year in the rural province of the Eastern Cape, a five-year-old girl drowned in a pit latrine.\rLumka Mkhethwa went missing without a trace from Luna Primary School in March.\rThe village was notified and a manhunt was conducted overnight by the community, but she could not be found.\rThe following day the police returned to the school where she had last been seen.\rA pack of sniffer dogs lead them to the grisly find. Her tiny body was at the bottom of a dark, faeces-filled toilet.\rAfter her death, South Africa's new President Cyril Ramaphosa called for pit latrines to be eradicated by the end of 2018.\rBut this ambitious plan will need money.\rAn interim government report suggests it will cost more than 11bn rand ($876m; £660m) - a sum it hopes to raise with help from the private sector.\r\"We are having to address many years of neglect and but change is coming, even if slowly,\" says Elijah Mhlanga, an official in the lower education ministry.\r\"These two incidents have been tragic but we are hoping that this shows everyone the seriousness of the crisis,\" he adds.\r\"We have received interest, with people offering to help with the funding.\r\"It is our intention to see that all the children in our schools are in safe facilities.\"\rIn another village in Limpopo province, word of Michael's death has changed the normal school routine.\rSebushi Primary School is modest, but clean and well-kept.\rBehind a vegetable garden sits a row of pit latrines.\rMany have a large opening at the back, where teachers now monitor pupils as they use them.\r\"Every morning from 06:00 a teacher patrols the toilets, monitoring who goes in and out,\" says Joseph Mashishi, chairman of this school's governing body.\r\"We don't want what happened to the Komape family to happen in our school. No child should have to die in faeces, it is inhumane.\"\rMany in Michael's community have now been stirred into action.\rThey are fighting to have new toilets installed in all the region's schools, in memory of the young boy whose life ended too early.","Nigeria's Tramadol crisis: The drug fuelling death, despair and Boko Haram":"After a BBC investigation in April showed the extent of codeine addiction in Nigeria, the production of codeine-based cough syrup was banned in Nigeria.\rBut codeine is not the only opioid scourge spreading across West Africa. Another painkiller, Tramadol, is fuelling widespread addiction - and as the BBC's Stephanie Hegarty found out, it may even be fuelling insurgency in the north-east.\rWhen Mustafa Kolo, 23, takes the bright red pills he feels like he can push a tree. It's like his body isn't his. They obliterate the negative thoughts.\r\"When I take it, I forget everything,\" he says.\rIt's 10:00, Mr Kolo and his friend Modu Mohamed are with their boss, the commander of a vigilante unit set up to protect the city of Maiduguri from Boko Haram.\rThe young recruits are clearly uncomfortable.\r\"How many did you take today?\" I asked them.\r\"Today? None,\" came the reply.\rMr Kolo's eyes are dark and bloody red, he slurs slightly as he talks. Mr Mohamed is listless and distracted. His head is hanging between his bony shoulders.\rIt's obvious they're lying. The commander steps in and urges them to tell the truth.\r\"I used to take three to four when I first began taking it. But now I have reduced it to one or half,\" Mr Kolo says, unwilling to go further.\rIn this troubled town, thousands of people are addicted to Tramadol - the vigilante fighters, those displaced by the war and even the militants themselves.\rThe cheap opioid painkiller is meant to be used to treat moderate to acute pain. But, like most opioids, it is addictive - although just how addictive is a matter for debate.\rThe World Health Organization (WHO) says Tramadol is generally thought to have a \"low potential for dependence relative to morphine\".\rBut the epidemic of addiction erupting across West Africa could yet disprove that.\r\"The problem is really huge,\" says Marcus Ayuba, head of a unit run by Nigeria's National Drug Law Enforcement Agency (NDLEA) that deals with drug dependency, bowing his head sadly.\r\"It's really huge.\"\rMr Ayuba runs an NDLEA drug treatment centre in Maiduguri, the state capital where, by his own estimate, one in three young people are addicted to the drug - an epidemic which, he believes, can be traced back to a decade of war.\r\"People have lost everything,\" he says. \"They are young people who were basically farmers, they've lost their farms, their homes.\"\r\"Parents have seen children killed in their presence,\" he adds.\rMr Ayuba says during counselling, people have told him, \"What else can we do? We just want to get out of the world.\"\rBut the crisis didn't bring Tramadol to Nigeria. Mr Kolo started taking Tramadol in 2007, two years before the insurgency began.\rAt first, he says he took it to help him to work. It dulled the pain of physical labour while helping to keep him awake.\rBut now because of his addiction, he can't get work. Instead he volunteers with the civilian vigilante force.\r\"It really helps me in fighting Boko Haram,\" he says. \"When I go into the bush, even the way I run, the way I walk, it's different. It gives me strength.\"\rBut the enemy too seems to have caught on to this trick.\rA former militant fighter is sitting in a soft, lilac coloured Hawaiian shirt.\rThe 21-year-old is in the custody of the Nigerian army after running away from Boko Haram in January.\rFor four years, he lived in a forest camp where there wasn't enough food or water - but there was Tramadol.\r\"When you are going for a military operation you will be given it to take, otherwise if you take it you will be killed,\" he says.\r\"They told us when you take it you will be less afraid - you will be strong and courageous.\"\rThe drug was once plentiful, but in the past few months, as the Nigerian army closed in on their camps, supplies became scarce.\rWhat is Tramadol?\rTramadol was reserved only for leaders and those going into battle. The former fighter believes they were all addicted.\rThe idea of an army of Islamist militants tanked up on opioids and sent out to kill is terrifying, and Mr Ayuba says believes it has contributed to the brutality of this conflict.\r\"Nobody has the natural will to take someone's life. Drugs are always there to give you the push,\" he says.\rThen there are the women who have escaped from Boko Haram and now find themselves addicted to drugs.\rOne 16-year-old told him the militants would drug girls when they started crying.\r\"When she escaped she was looking for something to knock her out,\" he says.\rAt the choked port of Lagos, an officer from the NDLEA orders men to break open a container with a crow bar. Stacked from top to bottom are boxes of an over-the-counter painkiller, but hidden behind them are thousands of packets of Tramadol.\rThe brand is Super RolmeX. On the packet it says \"Made in India, for export only\". That is because the dosage - at 225mg - is more than twice what is legal in most countries.\rIt says it's manufactured for Sintex Technologies Ltd in London, England, but a quick search on the UK companies register online shows that company was dissolved in 2012.\rThere are six containers and millions of tablets in this shipment alone.\rThe UN say Tramadol is being smuggled into Africa from South Asia by international criminal gangs, with yearly seizures in sub-Saharan Africa rising from 300kg (661lb)per year to more than three tonnes since 2013, according to a report in December.\rSo with abuse clearly happening in places like Nigeria, it's hard to understand why Tramadol is scheduled two ranks below oxycontin, morphine or high dosages of codeine by the US.\r\"It could be that it's a weak opioid,\" says Dr Eric Stein, an expert in drug abuse.\r\"At the end of the day the ready availability of stronger opioids make it unnecessary [for those trying to get high]\" he says.\r\"If you're looking to get drunk, do you drink a beer or do shots?\"\rSo why is it so prevalent in Nigeria? Firstly it is cheap - in Nigeria it's about $0.05 for 200mg as opposed to about $2.50 in the US, and secondly its ability to help people work. Across Africa, many people rely still on manual labour to get paid.\rMr Ayuba believes religion may have a part to play as well. Alcohol is forbidden in the majority Muslim communities of north-east Nigeria, but there is less of a taboo around prescription drugs.\rDespite anecdotal evidence, the WHO has so far resisted putting international controls on its trade.\rThere are fears limiting access to the drug would cut people off who really need it: it is one of the few painkillers widely available to treat pain for cancer patients.\rIt can also be brought in pretty easily to crisis and emergency situations, says Gilles Forte, secretary of the group responsible for reviewing Tramadol at the WHO.\r\"If it's scheduled it becomes difficult to move it from one country to another,\" he explains.\rBut as long as it is so freely available the addiction crisis will continue. As it is, Mr Ayuba can only manage a fraction of the cases he is presented with every day.\rThough they would like to, the parents of Mustafa Kolo - the young vigilante - cannot afford to send him to the drug treatment centre.\r\"I used to dream about grandchildren from him. Now, I see that I have lost,\" says his father.\r\"All my country has lost, because of what he is doing.\"","Letter from Africa: Mali 'Spiderman' is the superhero of our modern age":"In the latest in our series of letters from Africa, Sudanese cartoonist Khalid Albaih says the Malian migrant who scaled a building to save a child in Paris is the kind of superhero the world's migrants need.\rAs a child growing up reading translated DC and Marvel comics in Sudan, I believed in superheroes - but I didn't understand why none of them looked like me, or had stories that people like me could relate to.\rMaybe that's why I decided to become a cartoonist.\rAll my childhood feelings came to the surface on Tuesday when I stumbled across the viral video showing a man selflessly scaling four storeys of a building in less than 20 seconds in Paris, the French capital.\rHe went on to save a young boy hanging dangerously off the edge of a balcony.\rFuriously refreshing my Twitter feed, I began to receive bits and pieces about the identity of the mystery man dubbed the #ParisSpiderman.\rHis name was Mamoudou Gassama, an illegal immigrant from Mali.\rKhalid Albaih:\r\"In particular, it was interesting to note that his religion was not mentioned\"\rThis was a much better and more realistic plot than the Marvel blockbuster Black Panther, I thought to myself while refreshing the social media site in a bid to find this new hero's origin story.\rIn particular, it was interesting to note that his religion was not mentioned - usually among the first details to be revealed in click-bait headlines and hashtags when an immigrant does something negative.\rIn only a few hours, the headlines changed: #ParisSpiderman was invited to meet the French President Emmanuel Macron, who had decided he was going to grant him citizenship for his heroic efforts.\rIt was typical zero-to-hero intro to a superhero story.\rWhat his feat highlights is the stereotypes - black, struggling, poor, lives in a ghetto - and a quick fast-forward to the acceptance scene, where the unknown underdog saves the child in a public spectacle and POW!\rThere you have it, the introduction of the new \"minority\" hero - the new addition to the all-white superhero line-up.\rBut in fact scaling that building was probably one of the easiest things Mr Gassama had done in years.\rHe left Mali as a teenager and travelled to Libya - where he was arrested and beaten - before taking a perilous boat journey to the Italian coast.\rHe spent four years in Italy before arriving in France in September to join his brother.\rWithout legal documents in France, he had been sleeping on the floor of a cramped room in a residence for immigrants in Montreuil, outside Paris.\rHe rolled out a thin mattress each night and packed it up in the morning.\rWhat storytellers should do differently is shed more light on the details of his background and uncover the real hardships that our hero went through before he scaled that building to save the child.\rSuperman, the greatest of superheroes, was an immigrant, but he was the \"good kind\", the kind that looks \"normal\" and doesn't get randomly checked at security gates.\rSo let the introduction to this new and different superhero make France, and the rest of the world, realise that not all immigrants may know they have superpowers.\rBut, they deserve a chance.\rAnd to continue the comic analogy:\rIn our next issue of our new superhero life, how is our hero going to cope with his 15 minutes of fame?\r\"With great power comes great responsibility.\"\rWill our hero take in what Uncle Ben told Spiderman in the original comic?\rFollow us on Twitter @BBCAfrica, on Facebook at BBC Africa or on Instagram at bbcafrica","How Mozambique’s smuggling barons nurtured jihadists":"Attacks by young Islamist militants in northern Mozambique are fuelled by a mix of poverty and corruption, writes Joseph Hanlon.\rIn the most recent attack, 10 people were decapitated with machetes in Palma district in the country's northerly Cabo Delgado province.\rMore than 300 people have been detained by the police and army since the first attack in the port town Mocimboa da Praia on October 2017.\rCoastal northern Mozambique has a long history of trade and movement of people with the rest of East Africa, and people in this area are traditionally Muslim.\rThe offshore discovery of one of the largest natural gas fields in Africa in 2010 triggered dreams of wealth, but so far there has been little impact locally.\rGas will not be produced in the region until 2022 and there will be no serious government revenue until 2028 or later.\rThere is currently offshore exploration work being done and onshore construction of infrastructure. But as is common with mega-projects of this kind, few local opportunities have materialised.\rYouth unemployment therefore remains very high, as in the rest of Mozambique.\rIn 2015, poorly educated and marginalised young men, many of them itinerant street traders in Mocimboa da Praia, formed small groups and began to organise around a rudimentary form of Islamic fundamentalism.\rThey blamed both the mosques and the Mozambican state for their plight, and decided to challenge both.\rGroups marched into local mosques wearing shoes and carrying knives as an intentional sign of disrespect of what they saw as \"degenerate Islam\". Local people called them \"al-Shabab\", simply local Arabic for youth, or just \"the Shababs\".\rThe small cells realised the need to look outside both for weapons and religious training, and found surprising allies.\rMozambique has become increasingly corrupt in recent years and its coastal north has become a major centre for ivory, timber, heroin and ruby smuggling - with the involvement of police and other government officials.\rLocal smuggling barons incorporated the militant young men into their networks and paid them well.\rThe nearby border with Tanzania is not controlled and there has always been a movement of people. This has increased with more people smuggling - mainly from Kenya, Somalia and the Great Lakes through Mozambique to South Africa.\rThere were already young Tanzanian men in the Mocimboa da Praia street trading community who became part of the groups.\rAfter the 2012 killing in Kenya of Muslim cleric Aboud Rogo Mohammed (accused of supporting al-Shabab in Somalia), his followers came under pressure and moved south.\rThey built a presence in Kibiti, Tanzania, and crossed the Ruvuma River into Cabo Delgado by 2015.\rUsing incomes made from smuggling, religious networks, and people-traffickers, the extremist cells paid to send young men to Tanzania, Kenya and Somalia for military and Islamic training.\rThe income also helped bring radical clerics to Mozambique.\rWithin Mozambique, they hired a sacked policeman and two dismissed border guards to provide military training.\rA study of these groups based on a month of fieldwork by Mozambican Islamic cleric Sheik Saide Habibe and researchers Salvador Forquilha and João Pereira was reported in Maputo on 22 May.\rThe structure remains one of small cells, of 10 to 30 people, who are linked but only loosely, the study found.\rMost of the attacks appear to have been done by a single group.\rThis loose guerrilla format makes it difficult for the army and police to find these small groups.\rThere is now a large presence of army and riot police in three districts of Cabo Delgado. They have been accused of heavy handed tactics and of killing local people.\rTwo helicopters and a navy ship shelled the village of Mitumbate near Mocimboa da Praia on 23 and 24 December 2017 with at least 50 casualties.\rVillagers were accused of supporting the young Islamist militants.\rThe shelling was in response to an ambush of a riot police convoy on 17 December, which was going from Mocimboa da Praia to Mitumbate, in which the riot police's national director of reconnaissance was killed.\rThe growing role of young Islamic fundamentalists and incidents like mosque invasions had been reported to local and provincial police and officials since 2015.\rBut the response has been to turn a blind eye - partly not to rock the boat and jeopardise their own jobs by giving bad news to their superiors, and partly because the young militants have the support of the smuggling barons.\rSome commentators have pointed to the attacks' similarity to common guerrilla tactics, and also to the actions of the Renamo guerrilla movement in Mozambique when it first started in the late 1970s.\rThere is no overt political agenda and the first step is to establish a presence through fear, including atrocities such as the recent beheadings.\rAt the same time, they need to recruit new members and gain local support, and this is apparently being done through family links.\rBut the final goal is to encourage overreaction by the government, which they hope will turn communities against the government and toward them.\rAll of that appears to be happening in coastal Cabo Delgado.\rMeanwhile, Mozambique will have municipal elections on 10 October and national elections in 2019.\rFrelimo, which has governed since independence, is facing a growing backlash, in part because of the lack of rural development and the failure to create jobs - exactly what is at the heart of the Islamist youth militancy.\rAlthough Cabo Delgado has always voted overwhelmingly for Frelimo, the opposition - both Renamo and Mozambique Democratic Movement (MDM) - has also done well in these coastal areas.\rOnly time will tell whether the impoverished region's lack of development, jobs, growing corruption and heavy-handed response to extremism will help the opposition in the polls.\rIt could also be the toxic recipe needed to help grow these nascent extremist groups.\rJoseph Hanlon is a visiting senior fellow at the London School of Economics and editor of Mozambique Political Process Bulletin","Africa's week in pictures: 24-31 May 2018":"A selection of the best photos from across Africa and of Africans elsewhere in the world this week.\rPictures from AFP, Getty Images and Reuters.","South Africans' anger over land set to explode":"In a country grappling with so many different challenges, land reform in South Africa has recently emerged as a dominant and potentially explosive issue - the focus of furious political contestation and increasingly inflammatory rhetoric.\r\"Africa is for black people. Period. We need our land back and we're going to take it by force,\" said a woman amongst an angry crowd trying to occupy a field on the north-eastern edge of Johannesburg.\rShe is wearing a red beret indicating her support for the Economic Freedom Fighters (EFF), a small, radical party which advocates the nationalisation of all land in South Africa.\rThe field was empty, overgrown, unused, and far too much of a temptation.\r\"This is my boundary,\" said 50-year-old Christina Mashaba, striding through the long grass and pointing to a stick she had pushed into the ground, some 15 yards (13m) away.\r\"It's going to be my home… if the government will let me have the ground,\" she said, looking up, across the sunlit valley.\rA little further down the gentle slope, an electrician called Ishmael Motswali was examining an area already littered with homemade flags and markers.\r\"I came to check if I can get a piece of land, and to see if it is legal,\" he said.\r\"I'm renting a place at the moment. In my beautiful country, after 20 years of democracy, you can understand the frustration. I just want a piece of land where I can put my family.\"\rA few hundred metres further up the hill, at the entrance to the field, beside a brand-new housing estate, a large and increasingly angry crowd from the nearby township of Alexandra was confronted by a group of South African policemen, who were trying to seal the area, insisting that the land is private, and that \"land-grabbers\" would be dealt with harshly.\r\"Democracy?\" scoffed a community leader called Mafasi Kubai, after listening to the pleas of a police captain.\r\"How can we participate when some are super rich and others are poor. Whites should be empathetic… but they are exploiting us.\"\rAcross South Africa, such scenes and confrontations are becoming more common, as frustration with the slow pace of land reform grows.\rAnd with it, frequently, is a growing bitterness about the enduring economic power of the country's white minority.\rVast amounts of time and money have already been spent trying to address the issue of the land dispossession that occurred under racial apartheid, but the governing African National Congress (ANC) has little to show for it.\rA generation after the advent of democracy, black people still own a small fraction of farmland nationwide. The exact statistics are often contested, but its estimated that just 10% of commercial farmland has been redistributed through land reform programmes.\rThe country's new President Cyril Ramaphosa - who describes the land dispossession of the black majority during the apartheid era as South Africa's \"original sin\" - has promised to accelerate land reform, with an early focus on unused urban land.\rBut his party, the ANC - responding to pressure from groups like the EFF - is also actively considering the introduction of legislation to allow for the expropriation of land without compensation, a measure assumed by some to be targeting white-owned farm land.\rRead more: Can South Africa avoid doing a Zimbabwe on land?\r\"Legally expropriating, not land-grabbing,\" stressed the Land Reform Minister Maite Nkoana-Mashabane, in an interview.\r\"We should take the land… using legal processes. But quick, and not being told, 'Go there, don't go there.'\r\"It should no longer be about willing buyer, willing seller only. It should be about the willingness to share the land. And it should happen now.\"\rSuch statements, and the continuing policy uncertainty around the issue, have prompted some white farmers and pressure groups to make comparisons with Zimbabwe's chaotic, and economically disastrous land reform process.\r\"We saw exactly the same comments in Zimbabwe. Nowhere in the world has it ever worked,\" said Ian Cameron, of Afriforum, an Afrikaans rights lobby group.\rBut the government has firmly rejected such comparisons, and many farmers, and experts, are also inclined to be optimistic.\r\"This could be a turning point for South Africa. I think politically this is a moment of enormous opportunity,\" said Prof Ruth Hall, a leading expert on land reform, and prominent critic of the government's recent handling of the issue.\r\"For 20 years the state had a mandate for land reform and failed to do so. [President Jacob] Zuma rolled back the land reform programme. Almost no land was transferred in recent years. Now business and government are coming together. There's actually quite a lot of goodwill.\"\rProf Hall argues that land expropriation - with or without compensation - is already an option under the existing constitution, and that those pushing a constitutional amendment are doing so for political reasons.\rA simpler solution, and a more likely path for South Africa, she argues, is for test cases to come before the courts.\rLerato Senakhomo, cattle farmer\r\"I don't see us having another Zimbabwe\"\rMeanwhile, on her family's thriving cattle farm south of Johannesburg, 26-year-old Lerato Senakhomo is betting on a positive outcome.\rShe has already received government support, and the loan of 515 hectares (1,273 acres).\r\"We are getting there. I don't see us having another Zimbabwe. As a people we just need a little bit of a push, some finance… I don't think we'll fail. We must just take it slow,\" she said.\rBut therein lies the challenge for South Africa.\r\"Taking it slow\" is no longer an appealing thought for many poor communities, frustrated by the lack of progress, and increasingly spurred to direct action by firebrand politicians.\rOn a recent afternoon, on the eastern outskirts of the capital, Pretoria, hundreds of residents of an informal settlement, built a year earlier on government-owned land, surveyed the wreckage of their homes.\rTwo women sat, tearful and exhausted, beside a pile of salvaged belongings, while a group of men began loading tin sheets - formerly walls and roofs - on to a battered pickup truck.\rThe informal settlement, near Mamelodi township, had been destroyed by bulldozers sent in by the local council.\rNo provisions had been made for those rendered homeless.\rA group of uniformed children, returning from school, stood, bewildered, beside their former homes.\r\"It's our bloody land,\" roared Bongani Motswale, hoarse with screaming, as he paced up and down the dirt track in front of his plot.\rHe was incandescent with rage, having rushed home from work to discover that his home and possessions had been destroyed.\r\"We have stayed here more than one year. You can't just come and break everything without telling anyone, without notice, just break our houses and things and say, 'We must move.'\r\"We are humans. We are humans. This is our country. This is our land. We are staying here. Let them come and kill us.\"","Why Ghanaians are so slow to bury their dead":"In our series of letters from African journalists, writer Elizabeth Ohene considers why bodies are not buried for months, sometimes years, in Ghana.\rThis past week there was another one of those typically Ghanaian funeral stories in the news.\rThe body of a chief who had died six years ago was still in the morgue as the family bickered over who should be designated as the \"chief mourner\".\rI was, as is usual with me, outraged.\rBut the story did not attract much attention because we regularly leave dead bodies in the morgue for long periods to sort out the disputes that erupt after every death in this country.\rOur elaborate, expensive funerals and over-the-top dramatically carved caskets are well documented.\rIn spite of the keen interest I have taken in trying to work out how funerals came to have such a hold on our society, there are some things that I still cannot understand after all these years.\rSee more:\rI have to keep on trying to find explanations.\rTake the role of the \"family\" in funerals for example.\rAccording to our custom and tradition, which has been upheld by the law courts, once someone dies, the body belongs to the family.\rYou would think you know what and who constitute family, but once there is a death, the definition of family changes completely.\rA spouse and children suddenly do not qualify as family once there is a death.\rIt is only the family, referring to the extended family into which you are born, that decides on who the chief mourner is and all the other titles that come with a death.\rThis \"family\" and this chief mourner might not have seen or spoken for the past 30 years with the dearly departed, but they are deemed to know more about the dead person than the spouse and the children.\rThere then follows the interminable meetings which are presided over by this \"family\", where the word of the spouse and children can be ignored.\rIt then takes weeks to draw up an obituary notice and it is an intricate business getting the list of the mourners in the right order.\rSo the next time you see an obituary notice in a Ghanaian newspaper, you better be appreciative of the amount of work that went into drawing it up to ensure no offence has been caused and family feuds have not been started or old ones rekindled.\rThe choice of the chief mourner is critical because he is not only in charge of the funeral, he, and it is always a he, never a she, has the ultimate word on who succeeds the deceased.\rAll this while the body has to be kept in the fridge as there will be disputes about when and where to bury the dead person.\rNot surprising therefore that we often end up in court with injunctions preventing anybody from moving the dead bodies.\rSometimes the delay has nothing to do with disputes.\rWe take seriously the idea of giving the dead a befitting burial.\rWe refurbish the house in which the dearly departed lived and died or sometimes a new house has to be built to be able to stage a spectacular funeral.\rThat takes time.\rIf you want certain important personalities to be at the funeral, then a suitable date that would accommodate various diaries will have to be negotiated.\rAnd that takes time.\rThis weekend, I was at the funeral of a famous industrialist and politician, Nana Akenten Appiah-Menka.\rHis funeral brochure is a 226-page glossy production of photographs and tributes covering his life time of 84 years.\rThat takes time to compile.\rElizabeth Ohene:\r\"My mother died at the age of 90 and we buried her after three weeks and this was and is still regarded in our village as sacrilege\"\rAs I have been trying to find answers to the Ghanaian funeral phenomenon this past week, my thoughts went to a programme I presented on the BBC about refrigerators some three years ago.\rI now think I should have had a segment in that programme about some of the unintended consequences of the invention of refrigeration, which had otherwise been such a blessing to humanity.\rBefore mortuaries became popular in this country, we buried our dead within two to three days and then set a date for the final funeral rites.\rNow the regular period in which a dead body is kept in the mortuary before being buried ranges from three to six months.\rTen months to a year is not unheard of.\rWhen you try to bury someone within a period that is regarded as \"too early\", you are certain to invoke outrage.\rI know this from sad experience.\rMy mother died at the age of 90 and we buried her after three weeks and this was and is still regarded in our village as sacrilege and lack of respect to our beloved mother.\rI am blaming the Ghanaian funeral madness on refrigeration.\rWithout fridges, we would not be able to keep bodies for the ludicrously long periods we currently do.\rFollow us on Twitter @BBCAfrica, on Facebook at BBC Africa or on Instagram at bbcafrica","Letter from Africa: Why is no-one talking about the Zamfara conflict?":"In our series of letters from African journalists, Kadaria Ahmed looks at the brewing crisis in Nigeria's Zamfara State, which analysts say has the potential to become as deadly as the Boko Haram conflict.\rGrowing up nearly 50 years ago in Nigeria's north-western Zamfara State, I could never have imagined its future of grinding poverty and escalating violence.\rThe capital of Zamfara State, Gusau, used to be a prosperous town. British company John Holt ran a tannery, which bought and treated hides before shipping them off to Europe. Sugar giant Tate and Lyle had a presence. There was also a textile company, an oil mill, and a ginnery that prepared cotton for export.\rAs children, our favourite place in Gusau was the sweet factory, run by a Lebanese family who were, for all intents and purposes, locals. There, we could satisfy our cravings at very little cost.\rA functioning rail line moved goods out and across Nigeria, and brought people in, many of whom were drawn to the region's thriving industries.\rIn Gusau, there was a sizeable population of ethnic Yorubas from south-western Nigeria, Igbos from the south-east, and thriving Indian and Lebanese communities. This cosmopolitism partly fuelled the region's aspiration for statehood, which it attained in 1996.\rParents also had the pick of decent government schools, or those run by missionaries, for their children's education. The knowledge of untold wealth, in the form of huge gold deposits that lay buried under the soil, guaranteed a prosperous and affluent future for the state.\rOr so we thought.\rWe never factored in bad governance. The impact has been acute in Nigeria's northern states, which have experienced economic collapse, further pauperising its people, whose future was largely dependent on having decent, visionary leadership.\rThis is evident through the failure to build on the huge amounts of agricultural land, pluralistic populations, and unexplored mineral resources. There has been little attempt to mitigate the impact of climate change. Instead of utilising resources to educate and help its people, the northern political class has simply enriched itself.\rAccording to a recently released Oxford University Human Development Index, the state's poverty rate is 92%.\rWhile the economy declined, ultra-conservatism and lack of tolerance grew, and in 2000 Sharia was introduced in Zamfara State by former governor Ahmad Yerima, which seriously undermined the multicultural nature of the state.\rSource: Nigeria Data Portal, and others\rA succession of administrations have resorted to lazy, knee-jerk reactions to problems that require long-term holistic solutions. When cattle rustling became a problem in Zamfara, Governor Abdulaziz Yari created local vigilante groups to fight the thieves in 2013.\rIt did not take long for residents to start complaining about the vigilantes, who were now extorting and stealing from the very people they were meant to protect.\rVillages caught between vigilantes and rustlers started trying to organise and defend themselves, with dire consequences. The cycle of violence escalated with attacks and reprisals. An attempt to implement an amnesty programme has also failed.\rNow we have a spiralling, murky conflict in which all lines are blurred. The only thing that is certain is that innocent people continue to die in substantial numbers.\rDozens have died over the past few months during attacks on villages in Zamfara State. Due to a lack of reporting, it is impossible to tell what the total death toll has been in this ongoing six-year-conflict.\rOn 28 March, at least 28 people were slaughtered by unknown gunmen on motorbikes in the village of Bawar Daji, some 90km (55 miles) from Gusau. The slain were attending a funeral for victims murdered during a previous and painfully similar attack.\rFor many years, the killings, kidnappings and rapes were only occurring in rural areas of Zamfara. It was underreported as the victims live on the fringes of national consciousness: they are poor, rural folk, who eke out a living as farmers and herdsmen in an area geographically removed from the centre of governance.\rThe conflict doesn't lend itself to the binary reporting that the Nigerian media finds very seductive. Christians are not pitted against Muslim, or North versus the South, or Hausa-Fulani against other groups. It can't be reported as evidence of Nigeria's further fracturing along ethnic and religious lines. The cultural and religious identities of both the victims and perpetrators are mostly the same.\rThis all speaks to a wider, national problem of our failing Federal State that cannot fulfil its most fundamental role of protecting its people. And so the people of Zamfara are left mostly to their fate.\rAcross Nigeria, there are huge swathes of ungoverned space that lend themselves to lawlessness in the absence of a functional state security apparatus. Rugu forest in the north-west cuts across multiple regions including Zamfara the border with Niger. The forest has been described as the equivalent of Sambisa forest in Borno State, which has become a hideout for Boko Haram in recent years.\rChris Ngwodo, who is an expert on the region, says the situation in Zamfara is exactly where Borno State was in 2009-2010, when Boko Haram launched its bloody uprising. The conditions in Zamfara are \"perfect,\" he says. Perfect for another intractable conflict.\rMore Letters from Africa:\rIn defence of aid workers' lives of luxury\rThe teen rescuing street children in Nigeria\rWhy some Sudanese back the lecturer who beat his students\rInside Africa's WhatsApp's gated communities\rBraving slavery horrors for European dream","Letter from Africa: Thomas Mapfumo, Zimbabwe's lion, roars for his fans":"In our series of letters from Africa, journalist-turned-barrister Brian Hungwe reflects on the return from exile of Zimbabwean musician Thomas Mapfumo four months after Robert Mugabe's resignation as president.\rKnown to his fans as the \"Lion of Zimbabwe\", Mapfumo has long been a figure of protest.\rHis music was the soundtrack during the fight for independence and some of his songs were later banned by state-owned media under Mr Mugabe's government.\rSo the crowds roared with delight this weekend to have the 72-year-old music legend back on stage in the capital, Harare, after 14 years in self-imposed exile in the US.\rHe played until the early hours of Sunday morning, revealing a deep nostalgia for his distinctive style of struggle music, known as \"chimurenga\", which first gained him recognition during the war against the white-minority rule in the 1970s.\rIt is a haunting combination of electric guitar and traditional instruments, in particular the mbira or a thumb piano. It evokes a deep sense of spirituality, rooted in folklore - with lyrics in the Shona language that are sometimes difficult even for fluent speakers to understand or work out their deeper meaning.\rBefore his return, the musician tweeted some of his class tracks.\rIt is no surprise that these were amongst the songs played on radio during the days of the military takeover that led to the end of Mr Mugabe's 37-year rule.\rThe dreadlocked musician told me before his concert that Mr Mugabe only had himself to blame for his rushed exit from office.\r\"Corruption is bad, it's everywhere. If I meet Mugabe, I would tell him, 'You messed up.' He messed up,\" said Mapfumo, who is pencil thin and whose baritone voice still makes him a focus of attention.\rThe Lion of Zimbabwe\rWearing a pan-African coloured shirt, he frowned disdainfully as he relaxed back on to a couch - a soft grey thin mist of cigarette smoke swirling around the hotel room.\rHe reminisced that the last time he met Mr Mugabe was in January 1992.\r\"I had gone to pay my condolences - he had lost his wife Sally. He was quite engaging and happy that I had come,\" he says.\rBut his songs exposing alleged misrule and corruption won him powerful enemies that eventually forced him into exile two decades later.\r\"The economy and politics was bad, and I had to leave,\" said the musician, who rarely elaborates unless pushed.\r\"Mapfumo is certainly a man of his convictions and it is no surprise he is also known as 'Gandanga' or rebel\"\rThe country is now moving at speed into uncharted waters, but has challenges ahead, he says.\r\"I came back to be greeted by many potholes, roads are bad. Yet there are plenty of people driving nice cars.\r\"But there are no jobs, no industry, it's just chaos.\"\rIt is not just the political landscape that has changed.\rA new generation has no connections to his chimurenga music - house music and urban grooves are shaping the interests of young people.\rYet the young were amongst the thousands that watched him perform on Saturday - and his 1980s song Pidigori Waenda, about the departure of a political dictator who stifles dissent and whose exit or death should be a cause for celebration, sent the crowd into a delirium.\rA new track Chauya Chauya (Come What May) about the current political situation was interpreted by his fans as a call for people to vote in the first post-Mugabe election in July - and was so popular he played it twice during his homecoming concert.\rMapfumo is certainly a man of his convictions and it is no surprise he is also known as \"Gandanga\" or rebel.\r\"There was one Bob Marley, there was one Fela Kuti. And there is only one Thomas Mapfumo,\" he told me.\r\"Musicians are agents of change; they should speak out through their music, actions and words.\"\rMore on Zimbabwe post Mugabe:\rMapfumo has not come home to stay, admitting that the US is now his \"second home\".\rLike many Zimbabweans, his expectations ahead of elections are high.\rHowever, he strikes a note of caution.\r\"It's good this is a new beginning. We can only have hope for the future,\" he says.\r\"Poverty, unemployment, bad roads and corruption make me sick.\r\"There is no money in the banks; people are keeping money at home. This must be addressed as soon as possible.\r\"We want to see significant change here - not what has been happening.\"\rMore Letters from Africa:\rFollow us on Twitter @BBCAfrica, on Facebook at BBC Africa or on Instagram at bbcafrica.","Letter from Africa: The teenager fighting school bus sex pests":"In our series of letters from African journalists, Nigerian novelist and writer Adaobi Tricia Nwaubani admires a teenager's tenacity in tackling the harassment of pupils on the school commute.\rAllegations of physical or sexual abuse against teachers in Nigerian schools sometimes manage to grab a headline, but then fade without any follow-up story on how the case was resolved.\rIn 2016, girls at a prestigious boarding school in Lagos abandoned their exams in protest at pervasive sexual harassment by a male teacher.\rThose of us who endured similar unchecked bad behaviour during our school days cheered them on.\rI know from personal experience of studying in Nigeria, how powerless students can sometimes feel when faced with abusers who act with impunity, knowing that the cultures of silence and respect for elders are on their side.\rSo, I was impressed when I recently came across a Tanzanian teenager, who told me how she was creating an opportunity for students in her country to report harassment.\rModesta Joseph was just 15 when she decided in 2014 to do something about the constant harassment that she and other students in the Tanzanian city of Dar es Salaam faced on buses while travelling to or from school.\rAs students pay significantly reduced fares, some bus drivers and conductors on the crowded buses, popularly known as \"dala dala\", have felt licensed to treat them in whatever manner they please.\rThe reduced fares also led to reluctance by conductors to let students occupy spaces that could go to passengers who paid the full fare.\rMany students missed lessons after waiting hours at bus stops before finally fighting their way on board.\r\"Sometimes, the bus conductors hit us. If you are on the bus, they can just touch you whenever they want. Touching girls in sexual ways,\" Ms Joseph said.\r\"They can actually push you. One day, one of my friends, the conductor pushed her out when the vehicle started moving.\"\rSome students sustained injuries such as broken ankles while struggling to board buses.\rParticularly worrying to Ms Joseph was the attitude from older passengers on the buses.\r\"People old enough to be my parents. They would do nothing!\"\rMs Joseph saw an opportunity to channel her rage into action when she joined an after-school club run by the social enterprise, Apps and Girls.\rSince 2013, the organisation has provided free coding training to girls in schools around Tanzania, helping them to develop their own projects.\r\"They taught me how I can solve a problem using the computer science skill that I had,\" she said.\r\"I decided to do something that could allow students to report any harassment they face from bus conductors and bus drivers.\"\rWithin months of attending training sessions, Ms Joseph designed Our Cries, an app and also a website (which is currently being updated) that allows students to report abuse, developed with funding from a grant she won in a partly government-sponsored competition.\rStudents without access to the internet can send text messages or post their complaints in Our Cries wooden boxes placed around secondary schools.\rOur Cries entered into an informal partnership with the transportation authority in Tanzania, known as Sumatra, which works with the police to ensure that every report collected and submitted by Our Cries volunteers is acted on.\rComplaints can either be anonymous or include the identity of the student. They must include the number plate of the bus, its route and a detailed description of the incident.\rSince it was created in 2014, Our Cries has received hundreds of complaints, thanks to the stickers Ms Joseph has had placed in buses around Tanzania and seminars she continues to organise in schools as it is also about changing the attitudes of students - as some believe they deserved to be treated that way.\rMs Joseph is happy to see the impact that Our Cries has made so far. Some bus operators who abused students have been traced, fined or otherwise punished by Sumatra and the police.\rAlso, passengers on the buses are not so silent any more, students tell her. They speak up when a conductor starts to behave badly.\r\"They say: 'Don't touch them or else they will report you,'\" she said.\rMs Joseph is currently enrolled in a two-year programme at the African Leadership Academy (ALA) in South Africa.\rDuring her summer break from the residential secondary school, she plans to implement the next phase of Our Cries, which will focus on reporting sexual harassment by teachers in schools.\rAdaobi Tricia Nwaubani:\r\"Being aware that reports of sexual harassment could harm a school's profile might compel authorities here to tackle the situation with more seriousness\"\rShe wants to develop a ratings system that would enable parents to see the schools with the highest incidents of sexual harassment and decide whether or not they still want their children there.\rBeyond the recent #MeToo movement which encouraged women around the world to openly share their stories of sexual harassment - although Ms Joseph notes that the voices of teenagers were hardly heard - she is inspired by her own experiences while attending an all-girls school in Dar es Salaam, such as male teachers teasing students in sexual ways and freely commenting on their bodies.\rAgain, students seemed to think it was normal. Sometimes when she raised the issue with other young people, they described the sexual innuendoes as natural; something a girl should expect, especially if she has large breasts.\r\"You are a victim and they make you feel you are to be blamed,\" she said.\r\"I want society to become more aware. Some of our goals involve acknowledging the presence of these incidents, to empower the understanding of sexual harassment, providing a platform to voice up and give students a free space to open about these matters.\"\rStudents in Nigeria could do with a similar initiative. Being aware that reports of sexual harassment could harm a school's profile might compel authorities here to tackle the situation with more seriousness.\rFollow us on Twitter @BBCAfrica, on Facebook at BBC Africa or on Instagram at bbcafrica","The BBC News app gives you the best of BBC News wherever you are":"With the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place.\rClick here to download the BBC News app from the App Store for iPhone, iPad and iPod Touch.\rClick here to download the BBC News app from Google Play for Android devices.\rFeatures include:\rDepending on the contract you have, data charges may apply for accessing the internet on your mobile device.\rIf you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.\rThe BBC does not charge you to access mobile content.","BBC News on connected TV":"The App delivers the BBC's global, national and regional news coverage - on-demand - via an internet connection.\rThe design enables quick and simple discovery of video and text content - aligned with BBC News's coverage on web and mobile devices.\rNavigation around the app is done using the arrow keys and the enter and back keys on your remote control.\rAccessing the BBC News App\rThe app is available on connected TVs from Sony, Samsung, LG and more. It is also available on major television platforms including YouView, and Virgin TiVo - along with a range of streaming devices, including Amazon Fire TV and Now TV. The app can be found either in the device/platform's app store, or via the Red Button on connected televisions.\rThe BBC works with platforms and device manufacturers continually to ensure availability on as many devices and platforms as possible. Existing users of the BBC News app will be upgraded to the new version automatically.","BBC News Alerts":"This page explains how the BBC can keep you in touch with the latest news. We offer a daily email and Breaking News alerts via the News website, the News App and Twitter.\rSign up here to receive BBC News Daily which is published each weekday morning. You'll receive a digest of the day's top news stories and features from BBC News and some of the best writing from elsewhere on the internet.\rWhenever you come to the BBC News website on a tablet or computer, you'll get notified of the latest breaking news in the 'breaking news banner' which automatically appears at the bottom of your browser window.\rThe banner will disappear when you click on it, dismiss it or visit another page.\rPush notifications are available to users of smartphones and tablets who download the BBC News App, allowing you to receive breaking news alerts. When a push notification is received it will pop up on your screen similar to a text message, regardless of whether or not the app is open at the time. Depending on your settings the alert may also be accompanied by a sound. Tapping the notification will load the corresponding story in the app when it is available. Full details on how push alerts work are available for iPhone and iPads and Android.\rYou can choose to unsubscribe from push notifications from BBC News in your device's 'Notifications' screen.\rOn Twitter, we offer a breaking news account which you can follow and receive breaking news alerts as they happen. To subscribe login or register with Twitter and then follow @BBCBreaking.","Contact BBC News online - help, feedback and complaints":"Please choose one of the following:\rFor help to solve TV or Radio reception problems visit the Help Receiving TV and Radio website or use our Transmitter Checker tool to check for any known problems or faults in your area.\rTo send us a story.\rTo report factual or grammatical issues with our online stories.\rTo report a technical issue with the News website or app.\rIf you want to complain about any BBC news output, go to the BBC Complaints website."}